export const CASES = ["ονομαστική", "γενική", "αιτιατική", "κλητική"];

export const NOUN_HEADERS = ["πτώση", "ενικός", "πληθυντικός"];

export const NOUNS = {
  αγώνας: [
    ["ο αγώνας", "οι αγώνες"],
    ["του αγώνα", "των αγώνων"],
    ["τον αγώνα", "τους αγώνες"],
    ["αγώνα", "αγώνες"],
  ],
  μαθητής: [
    ["ο μαθητής", "οι μαθητές"],
    ["του μαθητή", "των μαθητών"],
    ["τον μαθητή", "τους μαθητές"],
    ["μαθητή", "μαθητές"],
  ],
  δρόμος: [
    ["ο δρόμος", "οι δρόμοι"],
    ["του δρόμου", "των δρόμων"],
    ["τον δρόμο", "τους δρόμους"],
    ["δρόμε", "δρόμους"],
  ],
  θάλασσα: [
    ["η θάλασσα", "οι θάλασσες"],
    ["της θάλασσας", "των θαλασσών"],
    ["την θάλασσα", "τις θάλασσες"],
    ["θάλασσα", "θάλασσες"],
  ],
  ψυχή: [
    ["η ψυχή", "οι ψυχές"],
    ["της ψυχής", "των φυχών"],
    ["την ψυχή", "τις φυχές"],
    ["ψυχή", "φυχές"],
  ],
};
