export const INSTRUCTIONS = {
  nouns: "Κλίνω το ουσιαστικό",
  verbs: "Κλίνω το ρήμα στον ενεστώτα",
};

export const CASES = ["ονομαστική", "γενική", "αιτιατική", "κλητική"];

export const NOUN_HEADERS = ["πτώση", "ενικός", "πληθυντικός"];

export const NOUNS = {
  αγώνας: [
    ["ο αγώνας", "οι αγώνες"],
    ["του αγώνα", "των αγώνων"],
    ["τον αγώνα", "τους αγώνες"],
    ["αγώνα", "αγώνες"],
  ],
  μαθητής: [
    ["ο μαθητής", "οι μαθητές"],
    ["του μαθητή", "των μαθητών"],
    ["τον μαθητή", "τους μαθητές"],
    ["μαθητή", "μαθητές"],
  ],
  δρόμος: [
    ["ο δρόμος", "οι δρόμοι"],
    ["του δρόμου", "των δρόμων"],
    ["τον δρόμο", "τους δρόμους"],
    ["δρόμε", "δρόμους"],
  ],
  θάλασσα: [
    ["η θάλασσα", "οι θάλασσες"],
    ["της θάλασσας", "των θαλασσών"],
    ["την θάλασσα", "τις θάλασσες"],
    ["θάλασσα", "θάλασσες"],
  ],
  ψυχή: [
    ["η ψυχή", "οι ψυχές"],
    ["της ψυχής", "των φυχών"],
    ["την ψυχή", "τις φυχές"],
    ["ψυχή", "φυχές"],
  ],
};

export const VERBS = {
  είμαι: [
    ["εγώ είμαι", "εμείς είμαστε"],
    ["εσύ είσαι", "εσείς είστε"],
    ["αυτός είναι", "αυτοί είναι"],
  ],
  κάνω: [
    ["εγώ κάνω", "εμείς κάνουμε"],
    ["εσύ κάνεις", "εσείς κάνετε"],
    ["αυτός κάνει", "αυτοί κάνουν"],
  ],
  μιλάω: [
    ["εγώ μιλάω", "εμείς μιλάμε"],
    ["εσύ μιλάς", "εσείς μιλάτε"],
    ["αυτός μιλάει", "αυτοί μιλάνε"],
  ],
  οδηγώ: [
    ["εγώ οδηγώ", "εμείς οδηγούμε"],
    ["εσύ οδηγείς", "εσείς οδηγείτε"],
    ["αυτός οδηγεί", "αυτοί οδηγούν"],
  ],
  έρχομαι: [
    ["εγώ έρχομαι", "εμείς ερχόμαστε"],
    ["εσύ έρχεσαι", "εσείς έρχεστε"],
    ["αυτός έρχεται", "αυτοί έρχονται"],
  ],
  κοιμάμαι: [
    ["εγώ κοιμάμαι", "εμείς κοιμόμαστε"],
    ["εσύ κοιμάσαι", "εσείς κοιμάστε"],
    ["αυτός κοιμάται", "αυτοί κοιμούνται"],
  ],
  αγαπιέμαι: [
    ["εγώ αγαπιέμαι", "εμείς αγαπιόμαστε"],
    ["εσύ αγαπιέσαι", "εσείς αγαπιέστε"],
    ["αυτός αγαπιέται", "αυτοί αγαπιούνται"],
  ],
  αφηγούμαι: [
    ["εγώ αφηγούμαι", "εμείς αφηγούμαστε"],
    ["εσύ αφηγείσαι", "εσείς αφηγείστε"],
    ["αυτός αφηγειέται", "αυτοί αφηγούνται"],
  ],
};

export const VERB_HEADERS = ["πρόσωπο", "ενικός", "πληθυντικός"];

export const PERSONS = ["πρώτο", "δεύτερο", "τρίτο"];
