export const NOUNS = {
    'αγώνας': [
        ['ο αγώνας', 'οι αγώνες'],
        ['του αγώνα', 'των αγώνων'],
        ['τον αγώνα', 'τους αγώνες'],
        ['αγώνα', 'αγώνες']
    ],
    'μαθητής': [
        ['ο μαθητής', 'οι μαθητές'],
        ['του μαθητή', 'των μαθητών'],
        ['τον μαθητή', 'τους μαθητές'],
        ['μαθητή', 'μαθητές']
    ],
    'δρόμος': [
        ['ο δρόμος', 'οι δρόμοι'],
        ['του δρόμου', 'των δρόμων'],
        ['τον δρόμο', 'τους δρόμους'],
        ['δρόμε', 'δρόμους']
    ],
    'θάλασσα': [
        ['η θάλασσα', 'οι θάλασσες'],
        ['της θάλαςςας', 'των θαλασσών'],
        ['τη θάλαςςα', 'τις θάλασσες'],
        ['θάλασσα', 'θάλασσες']
    ],
    'ψυχή': [
        ['η θέση', 'οι θέσεις'],
        ['της θέσης', 'των θέσεων'],
        ['τη θέση', 'τις θέσεις'],
        ['θέση', 'θέσεις']
    ]
}